{
  "basics": {
    "name": "Logan Grimsley",
    "label": "Full Stack Engineer",
    "email": "lgrimsley@gmail.com",
    "phone": "(502) 716-9026",
    "url": "https://lgrimsley.com",
    "resume_url": "/Logan Grimsley - Resume 11_2023.pdf",
    "summary": "Seasoned engineer specializing in rapid development of web applications and tenaciously pursuing project goals. Committed to engineering solid, effective solutions, I balance my professional pursuits with family life as an engaged father and supportive husband. An avid audiobook listener, I'm always learning and enjoy dissecting complex technical problems. My drive is simple: to excel in every challenge, at work and at home.",
    "status": "Open To Work",
    "information": {
      "location": "Louisville, KY",
      "yearsOfExperience": "10+",
      "availability": "Full Time",
      "relocation": "Open to Relocation",
      "remote": "Open to Remote"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "logan-grimsley",
        "url": "https://linkedin.com/in/logan-grimsley",
        "icon": "bi:linkedin"
      },
      {
        "network": "GitHub",
        "username": "lgrimsley",
        "url": "https://github.com/lgrimsley",
        "icon": "bi:github"
      }
    ],
    "image": "/avatar.png"
  },
  "work": [
    {
      "company": "Metabolic",
      "summary": "",
      "url": "https://metabolic.com",
      "logo_url": "",
      "tenure": "4 Years",
      "bullets": [
        "Initiated and led the front-end department as Frontend Architect, hiring and training developers to swiftly contribute to production.",
        "Developed high-performance front-end applications with Nuxt 3/Vue 3 and robust APIs using Laravel, enhancing user engagement and operational efficiency.",
        "Architected core infrastructure and services for system reliability and scale.",
        "Led service uptime monitoring and optimization of systems, including conversion rate & CPC optimization, UX overhauls, and legacy system abstraction.",
        "Collaborated with UX designers and leadership in creating scalable, user-centric features, contributing to a jump in company revenue from $30 million to $90 million annually."
      ],
      "location": "Remote",
      "positions": [
        {
          "position": "Frontend Architect",
          "startDate": "2022-05",
          "endDate": "2023-12",
          "summary": "Optional summary of the role."
        },
        {
          "position": "Senior Full Stack Engineer",
          "startDate": "2021-06",
          "endDate": "2022-05"
        },
        {
          "position": "Full Stack Engineer II",
          "startDate": "2020-01",
          "endDate": "2021-05"
        }
      ]
    },
    {
      "company": "Crosby Interactive",
      "summary": "",
      "url": "https://crosbyinteractive.com",
      "logo_url": "",
      "tenure": "6 Years",
      "bullets": [
        "Led the development team as CTO; improved efficiency and profitability by implementing Agile workflows.",
        "As Senior Web Developer, led and executed projects over $200,000, showcasing exceptional technical acumen and an ownership mentality.",
        "Developed and continuously improved a SaaS CRM system using Laravel.",
        "Started as Junior Developer, quickly advancing by mastering WordPress, Magento, and Zend, and excelling in client management and upselling."     
      ],
      "location": "Louisville, KY",
      "positions": [
        {
          "position": "Chief Technical Officer",
          "startDate": "2017-09",
          "endDate": "2019-10"
        },
        {
          "position": "Senior Web Developer",
          "startDate": "2014-10",
          "endDate": "2017-09"
        },
        {
          "position": "Junior Web Developer",
          "startDate": "2013-11",
          "endDate": "2014-10"
        }
      ]
    }
  ],
  "projects": [
    {
      "name": "Resume Web App",
      "summary": "JSON Powered Resume (you are here)",
      "url": "https://lgrimsley.com",
      "image_url": "/resume-website.png",
      "repo": {
        "icon": "bi:github",
        "url": "https://github.com/lgrimsley/resume",
        "private": false,
        "access": "Open Source"
      },
      "bullets": [
        "Designed and built a lightweight Vue application to display my resume.",
        "Create an extensive JSON data structure to standardize resume data.",
        "Implemented basic hydration methods into Pinia stores for data persistence.",
        "Created bespoke animations, customization tools, JSON viewer, and dark mode.",
        "Technical Stack: TailwindCSS, Vue 3, Pinia, Vercel, JSON"
      ],
      "keywords": ["Vue 3", "TailwindCSS", "Pinia", "Vercel", "Animation", "JSON"]
    },
    {
      "name": "Project Magic",
      "summary": "AI Powered Jira Planning - SaaS Prototype",
      "url": "https://projectmagic.ai",
      "image_url": "/project-magic.png",
      "repo": {
        "icon": "bi:github",
        "url": "https://github.com/lgrimsley/ticket-enricher",
        "private": true,
        "access": "Request Access"
      },
      "bullets": [
        "Developed a complex tool to automate Jira ticket generation using LLMs.",
        "Designed comprehensive Jira integration with flexible custom field support.",
        "Implemented parallel processing paradigms for scale and a responsive UX.",
        "Generate a highly customizable set of tickets for a described project in seconds.",
        "Technical Stack: TailwindCSS, Nuxt 3, Vue 3, Pinia, Laravel 10, MySQL, AWS."
      ],
      "keywords": ["Jira", "Automation", "LLM", "Nuxt 3", "Vue 3", "TailwindCSS", "Laravel 10", "MySQL", "AWS", "REST", "JSON API"]
    }
  ],
  "education": [],
  "references": [
    {
      "name": "Marc Stockman",
      "position": "CEO",
      "company": "Metabolic",
      "linkedin": "https://linkedin.com/in/marcstockman",
      "relationship": "Former Employer",
      "reference_type": "Professional"
    },
    {
      "name": "Luis Mata",
      "position": "CTO",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/cto-luis-mata/",
      "relationship": "Former Direct Report",
      "reference_type": "Professional"
    },
    {
      "name": "Alex Sterling",
      "position": "Senior Engineer",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/alex-sterling-5013942b/",
      "relationship": "Former Colleague",
      "reference_type": "Professional"
    },
    {
      "name": "Brandon Farber",
      "position": "Senior Engineer",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/brandonfarber/",
      "relationship": "Former Colleague",
      "reference_type": "Professional"
    },
    {
      "name": "Angie Thompson Evjen",
      "position": "Senior Director of UX",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/angiethompson2",
      "relationship": "Former Colleague",
      "reference_type": "Professional"
    },
    {
      "name": "Keith Adamson",
      "position": "Sr. Tech Delivery Manager",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/kadamson96/",
      "relationship": "Former Colleague",
      "reference_type": "Professional"
    }
  ],
  "recommendations": [
    {
      "name": "Luis Mata",
      "position": "CTO",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/cto-luis-mata/",
      "summary": "<p>As a Chief Technology Officer (CTO), one of my primary responsibilities is strategically preparing for leadership transitions within the company. In this context, Logan Grimsley would have been an exemplary choice for succeeding in a high-level technical role at Metabolic.</p><p> Since my initial interaction with Logan while collaborating with the CRO team, he has consistently demonstrated an exceptional blend of intuitive and analytical thinking. This rare combination is pivotal in making critical business and technical decisions. Logan's innate ability to navigate seamlessly between critical and creative thinking is a hallmark of effective leadership.</p><p>Logan's proficiency is not just limited to his cognitive skills. His technical expertise is remarkable, particularly in front-end design and backend development. He has shown an outstanding grasp of solid design principles and robust backend methodologies. His technical understanding and leadership skills make him an ideal candidate for a Chief Architect position in any organization.</p><p>His comprehensive skill set truly sets Logan apart, encompassing the management, leadership, mentoring, and technical prowess necessary to design and develop applications from the front end to the back end. His contributions have been instrumental in scaling the company's operations and enhancing overall efficiency. Logan's role in developing high-performance front-end applications using Nuxt 3/Vue 3 and crafting robust Laravel APIs have significantly boosted user engagement and operational efficiency. Additionally, his foresight in architecting core infrastructure and services for system reliability and scalability has been a cornerstone in the company's growth.</p><p>Logan's collaborative efforts with UX designers and leadership in creating scalable, user-centric features have improved user experience and contributed to a substantial increase in company revenue. His skills in REST APIs, system architecture, API development, and various other technologies are a testament to his versatility and depth of knowledge in the field.</p> <p>In summary, Logan Grimsley is a multifaceted professional with the necessary skills and vision to excel in a leadership role within the tech industry. His track record at Metabolic and his innate leadership qualities make him an invaluable asset for any organization looking to foster innovation and drive success.</p>"
    },
    {
      "name": "Angie Thompson Evjen",
      "position": "Senior Director of UX",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/angiethompson2",
      "summary": "<p>I had the privilege of working with with Logan for over 3 years at Metabolic, where I led the UX and product design team. During this time, Logan consistently demonstrated his exceptional skills as a full-stack developer. What truly sets Logan apart is his ability to seamlessly bridge the gap between back-end development and front-end user experience.</p><p>Logan's technical expertise is remarkable; he has the capability to create robust back-end systems while paying meticulous attention to perfecting the front-end down to the last pixel. His commitment to delivering top-notch user experiences is evident in every project we worked on together.</p><p>Plus, Logan is a dream to work with. He has an unwavering positive attitude and remains calm and composed even in the face of tight deadlines and challenging expectations. </p><p>I wholeheartedly recommend him to any organization seeking a versatile, skilled, and dedicated full-stack developer. Any team fortunate enough to have him on board will undoubtedly benefit from his expertise and positive presence.</p>"
    },
    {
      "name": "Alex Sterling",
      "position": "Senior Engineer",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/alex-sterling-5013942b/",
      "summary": "<p>Logan is a fantastic developer who is willing to dive into projects full of vague requirements or broad implementation guidelines (or none at all), take the reins to carefully define the specifics of the requirements and execute on an expert implementation that sets your project up for future success. Logan’s expertise in modern JavaScript frameworks, CSS/SCSS, PHP, SQL and more enable him to jump into a vast array of projects and perform.</p><p> Always with an eye to the future, Logan’s team chemistry and cross-functional communication skills set the business up for durable tech success. It is always a pleasure to deeply collaborate and creatively innovate with Logan as well as working completely separately with complete trust in Logan’s stewardship of any project.</p> <p>Whether you’re trying to burn down an intimidating mountain of aging tech debt or lay the dependable foundation for your tech platform, Logan’s abilities to troubleshoot, architect and deliver will always impress.</p>"
    },
    {
      "name": "Keith Adamson",
      "position": "Sr. Tech Delivery Manager",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/kadamson96/",
      "summary": "<p>Logan is an exceptional team player and rock-solid developer. I worked with Logan as the tech delivery manager for the team. Logan was the go-to-guy when we had difficult problems to solve, were up against tight timelines and when we needed a strong technical lead on high-priority initiatives.</p><p>Logan takes ownership within the team to deliver what the business requires, not only for the work he has on his plate but also goes out of his way to make sure the rest of the team is in a position to complete their goals.</p><p>Logan's ability to complete work quickly with high quality is nothing short of impressive. Logan also is a master of the 'soft' skills needed to lead. He's able to offer solutions, make smart decisions when information may be missing or incomplete, and communicate with non-technical team members to keep the whole group in sync.</p><p>Logan will be one of the most valuable developers on any team he joins in the future.</p>"
    },
    {
      "name": "Andrew Alba",
      "position": "Senior Full Stack Engineer",
      "company": "Metabolic",
      "linkedin": "https://www.linkedin.com/in/andrewalba/",
      "summary": "<p>It was my pleasure to work alongside Logan Grimsley for a year, and without hesitation, I recommend him for any senior full stack engineering position. Logan is not just a colleague; he's a true asset to any tech team.</p><p>Logan's generosity with his time is truly commendable. In an industry where time is often the scarcest resource, he goes above and beyond to help out, whether it's with troubleshooting code or explaining complex concepts to the team. His willingness to share knowledge and support his colleagues makes him a standout professional.</p><p>When it comes to technical skills, Logan's knowledge spans the entire spectrum of front-end and back-end technologies. His versatility allows him to seamlessly navigate through the intricacies of a project, contributing to its success from both the user interface to the server logic.</p><p>One of Logan's standout qualities is his fearlessness when it comes to challenging ideas. If he believes there's a better solution, he doesn't hesitate to voice his perspective, contributing to a culture of continuous improvement and innovation within the team.</p><p>Logan possesses a superpower for translating complicated business logic into easily understandable chunks. This skill not only makes him an effective communicator but also enhances the collaborative problem-solving dynamic within the team.</p><p>His patience and kindness are evident in every interaction. In an environment that can sometimes be high-pressure, Logan remains calm and collected, fostering a positive atmosphere for everyone.</p><p>His exceptional listening skills extend beyond the codebase – Logan is an avid consumer of audiobooks, showcasing his commitment to continuous learning and personal growth. And yes, he's not just a senior full stack engineer; he's a Star Wars fan, bringing a touch of the galaxy far, far away to the tech world.</p><p>In conclusion, Logan Grimsley is the kind of senior full stack engineer every team dreams of having. His technical expertise, collaborative spirit, and genuine personality make him an outstanding professional. I wholeheartedly recommend Logan for any position that requires a skilled and dedicated senior engineer.</p>"
    }
  ],
  "skills": {
    "languages": ["TypeScript", "JavaScript", "CSS", "PHP", "Node.js", "SQL", "HTML"],
    "technologies": ["Laravel", "Vue", "Nuxt", "Tailwind", "Bootstrap", "jQuery", "Blade", "REST", "OpenAPI", "SASS"],
    "services": ["SSH", "UNIX", "AWS", "DigitalOcean", "NGINX", "Apache", "Git", "GitHub", "Jira", "Bitbucket", "Opsgenie"],
    "tools": ["Visual Studio Code", "GPT-4", "Copilot", "Postman", "Docker", "Firefox Developer Edition", "HeidiSQL"]
  },
  "softSkills": ["Ownership Mentality", "Collaborative", "User Focused", "Language & Articulation", "Leadership & Empathy"]
}
